Revit 2024 API
FabricationConfiguration.GetMaterialGaugeGUID Method
 Gets the material gauge GUID by its material/gauge identifiers.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public Guid GetMaterialGaugeGUID(
	int materialId,
	int gaugeId
)
Visual Basic
Public Function GetMaterialGaugeGUID ( _
	materialId As Integer, _
	gaugeId As Integer _
) As Guid
Visual C++
public:
Guid GetMaterialGaugeGUID(
	int materialId,
	int gaugeId
)
Parameters
materialId
Type: System.Int32
 The material identifier. The same material gauge GUID could have different material gauge identifiers for different materials.
gaugeId
Type: System.Int32
 The material gauge identifier.
Return Value
 The material gauge GUID. Returns empty GUID if not found.
See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace